# JournalingAttribute Properties

---
The JournalingAttribute type exposes the following members.
| Name| Description
---|---|---
| Mode| Journaling mode.
| TypeId| When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute)
Top
#### Reference
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace